app/Controllers/Cbiblioteca.php

    public function buscador()
    {
        $librosModel = new Libros();
        $resultados = $librosModel->select('*')
                                 ->like('titulo',$_POST['busqueda'])
                                 ->findAll();
---
SELECT *
FROM `libros`
WHERE `titulo` LIKE '%El quijo%' ESCAPE '!'