app/Controllers/Cbiblioteca.php

    public function inicio(){
        $librosModel = new Libros();
        $favoritosModel = new Favoritos();
        $idUsuario = session()->get('id_usuario');

        $fav = $favoritosModel->where('id_usuario',$idUsuario)
                              ->findAll();

        $data = [
            "libros" => $librosModel->where('visible', 1)
                                    ->orderBy("fecha_subida","ASC")
                                    ->findAll(),
            "favoritosIds" => array_column($fav,"id_libro"),
            "header" => view("templates/header"),
            "footer" => view("templates/footer"),
        ];
---
SELECT *
FROM `favoritos`
WHERE `id_usuario` = '31'
SELECT *
FROM `libros`
WHERE `visible` = 1
ORDER BY `fecha_subida` ASC

    public function inicio_profesores(){

        $librosModel = new Libros();
        $favoritosModel = new Favoritos();
        $idUsuario = session()->get('id_usuario');

        $fav = $favoritosModel->where('id_usuario',$idUsuario)
                              ->findAll();

        $data = [
            "libros" => $librosModel->where('visible', 1)
                                    ->orderBy("fecha_subida","ASC")
                                    ->findAll(),
            "favoritosIds" => array_column($fav,"id_libro"),
            "header" => view("templates/header"),
            "footer" => view("templates/footer"),
        ];
---
SELECT *
FROM `favoritos`
WHERE `id_usuario` = '28'
SELECT *
FROM `libros`
WHERE `visible` = 1
ORDER BY `fecha_subida` ASC

    public function buscadorMostrar()
    {
        $favoritosModel = new Favoritos();
        $librosModel = new Libros();
        $idUsuario = session()->get('id_usuario');

        $fav = $favoritosModel->where("id_usuario",$idUsuario)
                              ->findAll();

        $data = [
            "favoritosIds" => array_column($fav,"id_libro"),
            'header' => view('templates/header'),
            'footer' => view('templates/footer'),
        ];
        if(!isset($_POST['busqueda'])){
            $resultados = $librosModel->select('*')
                                      ->orderBy('titulo','ASC')
                                      ->findAll();

            $data['resultados'] = $resultados;

            return view('vistas-biblioteca/libros',$data);

        }else{
            $resultados = $librosModel->select('*')
                            ->like('titulo',$_POST['busqueda'])
                            ->findAll();
---
SELECT *
FROM `favoritos`
WHERE `id_usuario` = '34'
SELECT *
FROM `libros`
WHERE `titulo` LIKE '%%' ESCAPE '!'

    public function favs($id=null){
        $favoritosModel = new Favoritos();
        $idUsuario = session()->get('id_usuario');

        $data = [
            "id_usuario" => $idUsuario,
            "id_libro" => $id
        ];

        $favoritosModel->insert($data);
---
INSERT INTO `favoritos` (`id_usuario`, `id_libro`) VALUES ('34', '15')

    public function favsdelete($id=null){
        $favoritosModel = new Favoritos();
        $idUsuario = session()->get('id_usuario');

        $favoritosModel->where("id_libro",$id)
                       ->where("id_usuario",$idUsuario)
                       ->delete();
---
DELETE FROM `favoritos`
WHERE `id_libro` = '1'
AND `id_usuario` = '28'

    public function favoritos(){
        $librosModel = new Libros();
        $favoritosModel = new Favoritos();
        $idUsuario = session()->get('id_usuario');

        $fav = $favoritosModel->where("id_usuario",$idUsuario)
                              ->findAll();

        $data = [
            "favoritosIds" => array_column($fav,"id_libro"),
            "libros" => $librosModel->where('visible',1)
                                    ->orderBy("fecha_subida","ASC")
                                    ->findAll(),
            "favoritos" => $favoritosModel->obtenerPorUsuario($idUsuario),
            "header" => view('templates/header'),
            "footer" => view('templates/footer')
        ];
---
SELECT *
FROM `favoritos`
WHERE `id_usuario` = '34'
SELECT *
FROM `libros`
WHERE `visible` = 1
ORDER BY `fecha_subida` ASC