app/Controllers/CrudLibros.php

SELECT *
FROM `favoritos`
WHERE `id_usuario` = '28'
SELECT *
FROM `etiquetas`
ORDER BY `id_libro` ASC
---
    public function index() //listar
    {
        $session = session();

        $librosModel = new Libros();
        $tagsModel = new etiquetas();
        $favoritosModel = new Favoritos();
        $idUsuario = session()->get('id_usuario'); // Obtén el ID del usuario actual desde la sesión.

        $fav = $favoritosModel->where("id_usuario",$idUsuario)
                            ->findAll();

        $data = [
            "favoritosIds" => array_column($fav,"id_libro"),
            'etiquetas' => $tagsModel->orderBy("id_libro","ASC")->findAll(),

SELECT *
FROM `etiquetas`
WHERE `etiquetas`.`id_libro` = '18'
SELECT *
FROM `libros`
WHERE `libros`.`id_libro` = '15'
---
    public function show($id = null)
    {
        if($id == null){
            return redirect()->to('/');
        }

        $librosModel = new Libros();
        $tagsModel = new Etiquetas();

        $data = [
            'id' => $id,
            'libro' => $librosModel->find($id),
            'etiquetas' => $tagsModel->find($id),
            'header' => view('templates/header'),
            'footer' => view('templates/footer')
        ];

INSERT INTO `libros` (`id_usuario`, `titulo`, `descripcion`, `portada`, `archivo`, `autor`) VALUES ('35', '123445', 'gasss', '1770590919_615b395c76d2f4c2d20d.png', 'Tecnología Digital Informe 1.pdf', 'Nigeria Wayne')
---
                "autor"=> $autor
            ];

            $idLibro = $librosModel->insert($datos, true); //insertarlos a la tabla libros