app/Controllers/CrudLibros.php

SELECT *
FROM `libros`
JOIN `etiquetas` ON `libros`.`id_libro` = `etiquetas`.`id_libro`
WHERE `id_usuario` = '31'
---
    public function index() //listar
    {
        $session = session();

        $librosModel = new Libros();
        $tagsModel = new etiquetas();
        $favoritosModel = new Favoritos();
        $idUsuario = session()->get('id_usuario'); // Obtén el ID del usuario actual desde la sesión.

        $fav = $favoritosModel->where("id_usuario",$idUsuario)
                            ->findAll();

        $data = [
            "favoritosIds" => array_column($fav,"id_libro"),
            'libros' => $librosModel->join("etiquetas","libros.id_libro = etiquetas.id_libro")
                                    ->select("*")
                                    ->where("id_usuario",$idUsuario)
                                    ->findAll(),

SELECT *
FROM `libros`
WHERE `id_libro` = '15'
 LIMIT 1
---
    public function edit($id = null) //editar
    {
        $librosModel = new libros();
        $tagsModel = new Etiquetas;

        $data = [
            'etiqueta' => $tagsModel->where("id_libro",$id)->first(),
            'libro' => $librosModel->where("id_libro",$id)->first(),