app/Controllers/CrudUsuarios.php

    public function show($id = null)
    {
        /*
        if($id == null or $id != session()->get('id_usuario')){
            return redirect()->to('/');
        }
        */

        $usuariosModel = new RegistroLogin();

        $data = [
            'id' => $id,
            'usuario' => $usuariosModel->find($id),
            'header' => view('templates/header'),
            'footer' => view('templates/footer')
        ];
---
SELECT *
FROM `login`
WHERE `login`.`id_usuario` = '27'