app/Models/Favoritos.php

SELECT *
FROM `favoritos`
WHERE `id_usuario` = '34'
---
    public function obtenerPorUsuario($idUsuario){
        return $this->where('id_usuario', $idUsuario)->findAll();