app/Models/Libros.php

    public function obtenerPorUsuario($idUsuario){
        return $this->where('id_usuario', $idUsuario)->findAll();
---
SELECT *
FROM `libros`
WHERE `id_usuario` = '28'